## Plan Result (sbox-aks)




<pre><code>Plan: 7 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.aks_auto_shutdown[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.genesis_managed_identity_operator[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.global_registry_acrpull[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.project_acrpull[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.uami_rg_identity_operator[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.update_checker[0]
* Update
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
        id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-00-aks"
        name                                = "cft-sbox-00-aks"
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (28 unchanged attributes hidden)

      ~ azure_active_directory_role_based_access_control {
          ~ admin_group_object_ids = [
                "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              - (sensitive value),
              + (sensitive value),
            ]
            # (3 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
        id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-00-aks|DiagLogAnalytics"
        name                       = "DiagLogAnalytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "cloud-controller-manager" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "cluster-autoscaler" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "csi-azuredisk-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "csi-azurefile-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "csi-snapshot-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "guard" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-apiserver" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-audit" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-audit-admin" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-controller-manager" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-scheduler" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "cluster-autoscaler"
          + enabled  = true
        }
      + log {
          + category = "guard"
          + enabled  = true
        }
      + log {
          + category = "kube-apiserver"
          + enabled  = true
        }
      + log {
          + category = "kube-audit-admin"
          + enabled  = false
        }
      + log {
          + category = "kube-controller-manager"
          + enabled  = true
        }
      + log {
          + category = "kube-scheduler"
          + enabled  = true
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.aks_auto_shutdown[0] will be created
  + resource "azurerm_role_assignment" "aks_auto_shutdown" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-00-aks"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_role_assignment.genesis_managed_identity_operator[0] will be created
  + resource "azurerm_role_assignment" "genesis_managed_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e86e2fb7-97e1-43f6-88c8-5f97a1d45cac"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_role_assignment.global_registry_acrpull[0] will be created
  + resource "azurerm_role_assignment" "global_registry_acrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e86e2fb7-97e1-43f6-88c8-5f97a1d45cac"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_role_assignment.node_infrastructure_update_scale_set will be created
  + resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e86e2fb7-97e1-43f6-88c8-5f97a1d45cac"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-00-aks-node-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_role_assignment.project_acrpull[0] will be created
  + resource "azurerm_role_assignment" "project_acrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e86e2fb7-97e1-43f6-88c8-5f97a1d45cac"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_role_assignment.uami_rg_identity_operator[0] will be created
  + resource "azurerm_role_assignment" "uami_rg_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e86e2fb7-97e1-43f6-88c8-5f97a1d45cac"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/managed-identities-sbox-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_role_assignment.update_checker[0] will be created
  + resource "azurerm_role_assignment" "update_checker" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "69c0f21d-e37c-41c2-8e16-b6873e941cea"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-00-aks"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 7 to add, 2 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster has changed
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
        id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-00-aks"
        name                                = "cft-sbox-00-aks"
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (28 unchanged attributes hidden)

      ~ kubelet_identity {
          ~ object_id                 = "870b83f0-55dd-4645-a1b8-d6f26a2e2f7a" -> "e86e2fb7-97e1-43f6-88c8-5f97a1d45cac"
            # (2 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":479,"Program":"tfcmt","SHA1":"","Target":"sbox-aks","Vars":{}} -->